bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA640.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file>
    <variants>
        <variant ordercode="ATmega640V-8AU" speedmax="8000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5"
                 package="TQFP100" pinout="TQFP100"/>
        <variant ordercode="ATmega640V-8CU" speedmax="8000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5"
                 package="CBGA100" pinout="CBGA100"/>
        <variant ordercode="ATmega640-16AU" speedmax="16000000" tempmin="-40" tempmax="85" vccmin="2.7" vccmax="5.5"
                 package="TQFP100" pinout="TQFP100"/>
        <variant ordercode="ATmega640-16CU" speedmax="16000000" tempmin="-40" tempmax="85" vccmin="2.7" vccmax="5.5"
                 package="CBGA100" pinout="CBGA100"/>
    </variants>
    <device name="ATmega640" family="AVR8" architecture="AVR8" avr-family="megaAVR">
        <address-spaces>
            <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x10000">
                <memory-segment start="0x0000" size="0x10000" type="flash" rw="RW" exec="1" name="FLASH"
                                pagesize="0x100"/>
                <memory-segment start="0xfc00" size="0x0400" type="flash" rw="RW" exec="1" name="BOOT_SECTION_1"
                                pagesize="0x100"/>
                <memory-segment start="0xf800" size="0x0800" type="flash" rw="RW" exec="1" name="BOOT_SECTION_2"
                                pagesize="0x100"/>
                <memory-segment start="0xf000" size="0x1000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_3"
                                pagesize="0x100"/>
                <memory-segment start="0xe000" size="0x2000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_4"
                                pagesize="0x100"/>
            </address-space>
            <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
            </address-space>
            <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0003">
                <memory-segment start="0" size="0x0003" type="fuses" rw="RW" exec="0" name="FUSES"/>
            </address-space>
            <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
            </address-space>
            <address-space endianness="little" name="data" id="data" start="0x0000" size="0x10000">
                <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
                <memory-segment name="MAPPED_IO" start="0x0020" size="0x01e0" type="io" external="false"/>
                <memory-segment name="IRAM" start="0x0200" size="0x2000" type="ram" external="false"/>
                <memory-segment name="XRAM" start="0x2200" size="0xde00" type="ram" external="true"/>
            </address-space>
            <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x1000">
                <memory-segment start="0x0000" size="0x1000" type="eeprom" rw="RW" exec="0" name="EEPROM"
                                pagesize="0x08"/>
            </address-space>
            <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
            <address-space endianness="little" name="osccal" id="osccal" start="0" size="1">
                <memory-segment start="0" size="1" type="osccal" rw="R" exec="0" name="OSCCAL"/>
            </address-space>
        </address-spaces>
        <peripherals>
            <module name="AC">
                <instance name="AC" caption="Analog Comparator">
                    <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data"
                                    caption="Analog Comparator"/>
                    <signals>
                        <signal group="AIN" index="0" function="default" pad="PE2"/>
                        <signal group="AIN" index="1" function="default" pad="PE3"/>
                    </signals>
                </instance>
            </module>
            <module name="USART">
                <instance name="USART0" caption="USART">
                    <register-group name="USART0" name-in-module="USART0" offset="0x00" address-space="data"
                                    caption="USART"/>
                    <signals>
                        <signal group="TXD" function="default" pad="PE1"/>
                        <signal group="RXD" function="default" pad="PE0"/>
                        <signal group="XCK" function="default" pad="PE2"/>
                    </signals>
                </instance>
                <instance name="USART1" caption="USART">
                    <register-group name="USART1" name-in-module="USART1" offset="0x00" address-space="data"
                                    caption="USART"/>
                    <signals>
                        <signal group="TXD" function="default" pad="PD3"/>
                        <signal group="RXD" function="default" pad="PD2"/>
                        <signal group="XCK" function="default" pad="PD5"/>
                    </signals>
                </instance>
                <instance name="USART2" caption="USART">
                    <register-group name="USART2" name-in-module="USART2" offset="0x00" address-space="data"
                                    caption="USART"/>
                    <signals>
                        <signal group="XCK" pad="PH2" function="default"/>
                        <signal group="TXD" pad="PH1" function="default"/>
                        <signal group="RXD" pad="PH0" function="default"/>
                    </signals>
                </instance>
                <instance name="USART3" caption="USART">
                    <register-group name="USART3" name-in-module="USART3" offset="0x00" address-space="data"
                                    caption="USART"/>
                    <signals>
                        <signal group="XCK" pad="PJ2" function="default"/>
                        <signal group="TXD" pad="PJ1" function="default"/>
                        <signal group="RXD" pad="PJ0" function="default"/>
                    </signals>
                </instance>
            </module>
            <module name="TWI">
                <instance name="TWI" caption="Two Wire Serial Interface">
                    <register-group name="TWI" name-in-module="TWI" offset="0x00" address-space="data"
                                    caption="Two Wire Serial Interface"/>
                    <signals>
                        <signal group="SDA" function="default" pad="PD1"/>
                        <signal group="SCL" function="default" pad="PD0"/>
                    </signals>
                </instance>
            </module>
            <module name="SPI">
                <instance name="SPI" caption="Serial Peripheral Interface">
                    <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data"
                                    caption="Serial Peripheral Interface"/>
                    <signals>
                        <signal group="SS" function="default" pad="PB0"/>
                        <signal group="MOSI" function="default" pad="PB2"/>
                        <signal group="MISO" function="default" pad="PB3"/>
                        <signal group="SCK" function="default" pad="PB1"/>
                    </signals>
                </instance>
            </module>
            <module name="PORT">
                <instance name="PORTA" caption="I/O Port">
                    <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PA0" index="0"/>
                        <signal group="P" function="default" pad="PA1" index="1"/>
                        <signal group="P" function="default" pad="PA2" index="2"/>
                        <signal group="P" function="default" pad="PA3" index="3"/>
                        <signal group="P" function="default" pad="PA4" index="4"/>
                        <signal group="P" function="default" pad="PA5" index="5"/>
                        <signal group="P" function="default" pad="PA6" index="6"/>
                        <signal group="P" function="default" pad="PA7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTB" caption="I/O Port">
                    <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PB0" index="0"/>
                        <signal group="P" function="default" pad="PB1" index="1"/>
                        <signal group="P" function="default" pad="PB2" index="2"/>
                        <signal group="P" function="default" pad="PB3" index="3"/>
                        <signal group="P" function="default" pad="PB4" index="4"/>
                        <signal group="P" function="default" pad="PB5" index="5"/>
                        <signal group="P" function="default" pad="PB6" index="6"/>
                        <signal group="P" function="default" pad="PB7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTC" caption="I/O Port">
                    <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PC0" index="0"/>
                        <signal group="P" function="default" pad="PC1" index="1"/>
                        <signal group="P" function="default" pad="PC2" index="2"/>
                        <signal group="P" function="default" pad="PC3" index="3"/>
                        <signal group="P" function="default" pad="PC4" index="4"/>
                        <signal group="P" function="default" pad="PC5" index="5"/>
                        <signal group="P" function="default" pad="PC6" index="6"/>
                        <signal group="P" function="default" pad="PC7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTD" caption="I/O Port">
                    <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PD0" index="0"/>
                        <signal group="P" function="default" pad="PD1" index="1"/>
                        <signal group="P" function="default" pad="PD2" index="2"/>
                        <signal group="P" function="default" pad="PD3" index="3"/>
                        <signal group="P" function="default" pad="PD4" index="4"/>
                        <signal group="P" function="default" pad="PD5" index="5"/>
                        <signal group="P" function="default" pad="PD6" index="6"/>
                        <signal group="P" function="default" pad="PD7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTE" caption="I/O Port">
                    <register-group name="PORTE" name-in-module="PORTE" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PE0" index="0"/>
                        <signal group="P" function="default" pad="PE1" index="1"/>
                        <signal group="P" function="default" pad="PE2" index="2"/>
                        <signal group="P" function="default" pad="PE3" index="3"/>
                        <signal group="P" function="default" pad="PE4" index="4"/>
                        <signal group="P" function="default" pad="PE5" index="5"/>
                        <signal group="P" function="default" pad="PE6" index="6"/>
                        <signal group="P" function="default" pad="PE7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTF" caption="I/O Port">
                    <register-group name="PORTF" name-in-module="PORTF" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PF0" index="0"/>
                        <signal group="P" function="default" pad="PF1" index="1"/>
                        <signal group="P" function="default" pad="PF2" index="2"/>
                        <signal group="P" function="default" pad="PF3" index="3"/>
                        <signal group="P" function="default" pad="PF4" index="4"/>
                        <signal group="P" function="default" pad="PF5" index="5"/>
                        <signal group="P" function="default" pad="PF6" index="6"/>
                        <signal group="P" function="default" pad="PF7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTG" caption="I/O Port">
                    <register-group name="PORTG" name-in-module="PORTG" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PG0" index="0"/>
                        <signal group="P" function="default" pad="PG1" index="1"/>
                        <signal group="P" function="default" pad="PG2" index="2"/>
                        <signal group="P" function="default" pad="PG3" index="3"/>
                        <signal group="P" function="default" pad="PG4" index="4"/>
                        <signal group="P" function="default" pad="PG5" index="5"/>
                        <signal group="P" function="default" pad="PG6" index="6"/>
                        <signal group="P" function="default" pad="PG7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTH" caption="I/O Port">
                    <register-group name="PORTH" name-in-module="PORTH" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PH0" index="0"/>
                        <signal group="P" function="default" pad="PH1" index="1"/>
                        <signal group="P" function="default" pad="PH2" index="2"/>
                        <signal group="P" function="default" pad="PH3" index="3"/>
                        <signal group="P" function="default" pad="PH4" index="4"/>
                        <signal group="P" function="default" pad="PH5" index="5"/>
                        <signal group="P" function="default" pad="PH6" index="6"/>
                        <signal group="P" function="default" pad="PH7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTJ" caption="I/O Port">
                    <register-group name="PORTJ" name-in-module="PORTJ" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PJ0" index="0"/>
                        <signal group="P" function="default" pad="PJ1" index="1"/>
                        <signal group="P" function="default" pad="PJ2" index="2"/>
                        <signal group="P" function="default" pad="PJ3" index="3"/>
                        <signal group="P" function="default" pad="PJ4" index="4"/>
                        <signal group="P" function="default" pad="PJ5" index="5"/>
                        <signal group="P" function="default" pad="PJ6" index="6"/>
                        <signal group="P" function="default" pad="PJ7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTK" caption="I/O Port">
                    <register-group name="PORTK" name-in-module="PORTK" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PK0" index="0"/>
                        <signal group="P" function="default" pad="PK1" index="1"/>
                        <signal group="P" function="default" pad="PK2" index="2"/>
                        <signal group="P" function="default" pad="PK3" index="3"/>
                        <signal group="P" function="default" pad="PK4" index="4"/>
                        <signal group="P" function="default" pad="PK5" index="5"/>
                        <signal group="P" function="default" pad="PK6" index="6"/>
                        <signal group="P" function="default" pad="PK7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTL" caption="I/O Port">
                    <register-group name="PORTL" name-in-module="PORTL" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PL0" index="0"/>
                        <signal group="P" function="default" pad="PL1" index="1"/>
                        <signal group="P" function="default" pad="PL2" index="2"/>
                        <signal group="P" function="default" pad="PL3" index="3"/>
                        <signal group="P" function="default" pad="PL4" index="4"/>
                        <signal group="P" function="default" pad="PL5" index="5"/>
                        <signal group="P" function="default" pad="PL6" index="6"/>
                        <signal group="P" function="default" pad="PL7" index="7"/>
                    </signals>
                </instance>
            </module>
