bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA640.xml
                <register caption="" name="LOW" offset="0x00" size="1" initval="0x62">
                    <bitfield caption="Divide clock by 8 internally" mask="0x80" name="CKDIV8"/>
                    <bitfield caption="Clock output on PORTE7" mask="0x40" name="CKOUT"/>
                    <bitfield caption="Select Clock Source" mask="0x3F" name="SUT_CKSEL" values="ENUM_SUT_CKSEL"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_SUT_CKSEL">
                <value caption="Ext. Clock; Start-up time: 6 CK + 0 ms" name="EXTCLK_6CK_0MS" value="0x00"/>
                <value caption="Ext. Clock; Start-up time: 6 CK + 4.1 ms" name="EXTCLK_6CK_4MS1" value="0x10"/>
                <value caption="Ext. Clock; Start-up time: 6 CK + 65 ms" name="EXTCLK_6CK_65MS" value="0x20"/>
                <value caption="Int. RC Osc.; Start-up time: 6 CK + 0 ms" name="INTRCOSC_6CK_0MS" value="0x02"/>
                <value caption="Int. RC Osc.; Start-up time: 6 CK + 4.1 ms" name="INTRCOSC_6CK_4MS1" value="0x12"/>
                <value caption="Int. RC Osc.; Start-up time: 6 CK + 65 ms" name="INTRCOSC_6CK_65MS" value="0x22"/>
                <value caption="Int. 128kHz RC Osc.; Start-up time: 6 CK + 0 ms" name="INTRCOSC_128KHZ_6CK_0MS"
                       value="0x03"/>
                <value caption="Int. 128kHz RC Osc.; Start-up time: 6 CK + 4 ms" name="INTRCOSC_128KHZ_6CK_4MS"
                       value="0x13"/>
                <value caption="Int. 128kHz RC Osc.; Start-up time: 6 CK + 64 ms" name="INTRCOSC_128KHZ_6CK_64MS"
                       value="0x23"/>
                <value caption="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 0 ms" name="EXTLOFXTAL_1KCK_0MS"
                       value="0x04"/>
                <value caption="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4.1 ms" name="EXTLOFXTAL_1KCK_4MS1"
                       value="0x14"/>
                <value caption="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 65 ms" name="EXTLOFXTAL_1KCK_65MS"
                       value="0x24"/>
                <value caption="Ext. Low-Freq. Crystal; Start-up time: 32K CK + 0 ms" name="EXTLOFXTAL_32KCK_0MS"
                       value="0x05"/>
                <value caption="Ext. Low-Freq. Crystal; Start-up time: 32K CK + 4.1 ms" name="EXTLOFXTAL_32KCK_4MS1"
                       value="0x15"/>
                <value caption="Ext. Low-Freq. Crystal; Start-up time: 32K CK + 65 ms" name="EXTLOFXTAL_32KCK_65MS"
                       value="0x25"/>
                <value caption="Full Swing Oscillator; Start-up time: 258 CK + 4.1 ms; Ceramic res.; fast rising power"
                       name="FSOSC_258CK_4MS1_CRES_FASTPWR" value="0x06"/>
                <value caption="Full Swing Oscillator; Start-up time: 258 CK + 65 ms; Ceramic res.; slowly rising power"
                       name="FSOSC_258CK_65MS_CRES_SLOWPWR" value="0x16"/>
                <value caption="Full Swing Oscillator; Start-up time: 1K CK + 0 ms; Ceramic res.; BOD enable"
                       name="FSOSC_1KCK_0MS_CRES_BODEN" value="0x26"/>
                <value caption="Full Swing Oscillator; Start-up time: 1K CK + 4.1 ms; Ceramic res.; fast rising power"
                       name="FSOSC_1KCK_4MS1_CRES_FASTPWR" value="0x36"/>
                <value caption="Full Swing Oscillator; Start-up time: 1K CK + 65 ms; Ceramic res.; slowly rising power"
                       name="FSOSC_1KCK_65MS_CRES_SLOWPWR" value="0x07"/>
                <value caption="Full Swing Oscillator; Start-up time: 16K CK + 0 ms; Crystal Osc.; BOD enabled"
                       name="FSOSC_16KCK_0MS_XOSC_BODEN" value="0x17"/>
                <value caption="Full Swing Oscillator; Start-up time: 16K CK + 4.1 ms; Crystal Osc.; fast rising power"
                       name="FSOSC_16KCK_4MS1_XOSC_FASTPWR" value="0x27"/>
                <value caption="Full Swing Oscillator; Start-up time: 16K CK + 65 ms; Crystal Osc.; slowly rising power"
                       name="FSOSC_16KCK_65MS_XOSC_SLOWPWR" value="0x37"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 258 CK + 4.1 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_258CK_4MS1" value="0x08"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 258 CK + 65 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_258CK_65MS" value="0x18"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 1K CK + 0 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_1KCK_0MS" value="0x28"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 1K CK + 4.1 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_1KCK_4MS1" value="0x38"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 1K CK + 65 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_1KCK_65MS" value="0x09"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 16K CK + 0 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_16KCK_0MS" value="0x19"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 16K CK + 4.1 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_16KCK_4MS1" value="0x29"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 16K CK + 65 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_16KCK_65MS" value="0x39"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 258 CK + 4.1 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_258CK_4MS1" value="0x0A"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 258 CK + 65 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_258CK_65MS" value="0x1A"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 1K CK + 0 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_1KCK_0MS" value="0x2A"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 1K CK + 4.1 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_1KCK_4MS1" value="0x3A"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 1K CK + 65 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_1KCK_65MS" value="0x0B"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 16K CK + 0 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_16KCK_0MS" value="0x1B"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 16K CK + 4.1 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_16KCK_4MS1" value="0x2B"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 16K CK + 65 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_16KCK_65MS" value="0x3B"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 258 CK + 4.1 ms"
                       name="EXTXOSC_3MHZ_8MHZ_258CK_4MS1" value="0x0C"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 258 CK + 65 ms"
                       name="EXTXOSC_3MHZ_8MHZ_258CK_65MS" value="0x1C"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 1K CK + 0 ms"
                       name="EXTXOSC_3MHZ_8MHZ_1KCK_0MS" value="0x2C"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 1K CK + 4.1 ms"
                       name="EXTXOSC_3MHZ_8MHZ_1KCK_4MS1" value="0x3C"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 1K CK + 65 ms"
                       name="EXTXOSC_3MHZ_8MHZ_1KCK_65MS" value="0x0D"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 16K CK + 0 ms"
                       name="EXTXOSC_3MHZ_8MHZ_16KCK_0MS" value="0x1D"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 16K CK + 4.1 ms"
                       name="EXTXOSC_3MHZ_8MHZ_16KCK_4MS1" value="0x2D"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 16K CK + 65 ms"
                       name="EXTXOSC_3MHZ_8MHZ_16KCK_65MS" value="0x3D"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 258 CK + 4.1 ms"
                       name="EXTXOSC_8MHZ_XX_258CK_4MS1" value="0x0E"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 258 CK + 65 ms"
                       name="EXTXOSC_8MHZ_XX_258CK_65MS" value="0x1E"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 1K CK + 0 ms"
                       name="EXTXOSC_8MHZ_XX_1KCK_0MS" value="0x2E"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 1K CK + 4.1 ms"
                       name="EXTXOSC_8MHZ_XX_1KCK_4MS1" value="0x3E"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 1K CK + 65 ms"
                       name="EXTXOSC_8MHZ_XX_1KCK_65MS" value="0x0F"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 16K CK + 0 ms"
                       name="EXTXOSC_8MHZ_XX_16KCK_0MS" value="0x1F"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 16K CK + 4.1 ms"
                       name="EXTXOSC_8MHZ_XX_16KCK_4MS1" value="0x2F"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 16K CK + 65 ms"
                       name="EXTXOSC_8MHZ_XX_16KCK_65MS" value="0x3F"/>
            </value-group>
