bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA640.xml
                <register caption="USART Baud Rate Register Bytes" name="UBRR0" offset="0xC4" size="2" mask="0x0FFF"/>
            </register-group>
            <register-group caption="USART" name="USART1">
                <register caption="USART I/O Data Register" name="UDR1" offset="0xCE" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="USART Control and Status Register A" name="UCSR1A" offset="0xC8" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC1"/>
                    <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC1"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE1"/>
                    <bitfield caption="Framing Error" mask="0x10" name="FE1"/>
                    <bitfield caption="Data overRun" mask="0x08" name="DOR1"/>
                    <bitfield caption="Parity Error" mask="0x04" name="UPE1"/>
                    <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X1"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM1"/>
                </register>
                <register caption="USART Control and Status Register B" name="UCSR1B" offset="0xC9" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE1"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE1"/>
                    <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE1"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN1"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN1"/>
                    <bitfield caption="Character Size" mask="0x04" name="UCSZ12"/>
                    <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB81"/>
                    <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB81"/>
                </register>
                <register caption="USART Control and Status Register C" name="UCSR1C" offset="0xCA" size="1">
                    <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL1" values="COMM_USART_MODE_2BIT"/>
                    <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM1" values="COMM_UPM_PARITY_MODE"/>
                    <bitfield caption="Stop Bit Select" mask="0x08" name="USBS1" values="COMM_STOP_BIT_SEL"/>
                    <bitfield caption="Character Size" mask="0x06" name="UCSZ1"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL1"/>
                </register>
                <register caption="USART Baud Rate Register Bytes" name="UBRR1" offset="0xCC" size="2" mask="0x0FFF"/>
            </register-group>
            <register-group caption="USART" name="USART2">
                <register caption="USART I/O Data Register" name="UDR2" offset="0xD6" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="USART Control and Status Register A" name="UCSR2A" offset="0xD0" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC2"/>
                    <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC2"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE2"/>
                    <bitfield caption="Framing Error" mask="0x10" name="FE2"/>
                    <bitfield caption="Data overRun" mask="0x08" name="DOR2"/>
                    <bitfield caption="Parity Error" mask="0x04" name="UPE2"/>
                    <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X2"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM2"/>
                </register>
                <register caption="USART Control and Status Register B" name="UCSR2B" offset="0xD1" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE2"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE2"/>
                    <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE2"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN2"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN2"/>
                    <bitfield caption="Character Size" mask="0x04" name="UCSZ22"/>
                    <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB82"/>
                    <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB82"/>
                </register>
                <register caption="USART Control and Status Register C" name="UCSR2C" offset="0xD2" size="1">
                    <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL2" values="COMM_USART_MODE_2BIT"/>
                    <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM2" values="COMM_UPM_PARITY_MODE"/>
                    <bitfield caption="Stop Bit Select" mask="0x08" name="USBS2" values="COMM_STOP_BIT_SEL"/>
                    <bitfield caption="Character Size" mask="0x06" name="UCSZ2"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL2"/>
                </register>
                <register caption="USART Baud Rate Register Bytes" name="UBRR2" offset="0xD4" size="2" mask="0x0FFF"/>
            </register-group>
            <register-group caption="USART" name="USART3">
                <register caption="USART I/O Data Register" name="UDR3" offset="0x136" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="USART Control and Status Register A" name="UCSR3A" offset="0x130" size="1"
                          ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC3"/>
                    <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC3"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE3"/>
                    <bitfield caption="Framing Error" mask="0x10" name="FE3"/>
                    <bitfield caption="Data overRun" mask="0x08" name="DOR3"/>
                    <bitfield caption="Parity Error" mask="0x04" name="UPE3"/>
                    <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X3"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM3"/>
                </register>
                <register caption="USART Control and Status Register B" name="UCSR3B" offset="0x131" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE3"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE3"/>
                    <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE3"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN3"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN3"/>
                    <bitfield caption="Character Size" mask="0x04" name="UCSZ32"/>
                    <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB83"/>
                    <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB83"/>
                </register>
                <register caption="USART Control and Status Register C" name="UCSR3C" offset="0x132" size="1">
                    <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL3" values="COMM_USART_MODE_2BIT"/>
                    <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM3" values="COMM_UPM_PARITY_MODE"/>
                    <bitfield caption="Stop Bit Select" mask="0x08" name="USBS3" values="COMM_STOP_BIT_SEL"/>
                    <bitfield caption="Character Size" mask="0x06" name="UCSZ3"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL3"/>
                </register>
