bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA640.xml
            <register-group caption="I/O Port" name="PORTB">
                <register caption="Port B Data Register" name="PORTB" offset="0x25" size="1" mask="0xFF"/>
                <register caption="Port B Data Direction Register" name="DDRB" offset="0x24" size="1" mask="0xFF"/>
                <register caption="Port B Input Pins" name="PINB" offset="0x23" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTC">
                <register caption="Port C Data Register" name="PORTC" offset="0x28" size="1" mask="0xFF"/>
                <register caption="Port C Data Direction Register" name="DDRC" offset="0x27" size="1" mask="0xFF"/>
                <register caption="Port C Input Pins" name="PINC" offset="0x26" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTD">
                <register caption="Port D Data Register" name="PORTD" offset="0x2B" size="1" mask="0xFF"/>
                <register caption="Port D Data Direction Register" name="DDRD" offset="0x2A" size="1" mask="0xFF"/>
                <register caption="Port D Input Pins" name="PIND" offset="0x29" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTE">
                <register caption="Data Register, Port E" name="PORTE" offset="0x2E" size="1" mask="0xFF"/>
                <register caption="Data Direction Register, Port E" name="DDRE" offset="0x2D" size="1" mask="0xFF"/>
                <register caption="Input Pins, Port E" name="PINE" offset="0x2C" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTF">
                <register caption="Data Register, Port F" name="PORTF" offset="0x31" size="1" mask="0xFF"/>
                <register caption="Data Direction Register, Port F" name="DDRF" offset="0x30" size="1" mask="0xFF"/>
                <register caption="Input Pins, Port F" name="PINF" offset="0x2F" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTG">
                <register caption="Data Register, Port G" name="PORTG" offset="0x34" size="1" mask="0x3F"/>
                <register caption="Data Direction Register, Port G" name="DDRG" offset="0x33" size="1" mask="0x3F"/>
                <register caption="Input Pins, Port G" name="PING" offset="0x32" size="1" mask="0x3F"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTH">
                <register caption="PORT H Data Register" name="PORTH" offset="0x102" size="1" mask="0xFF"/>
                <register caption="PORT H Data Direction Register" name="DDRH" offset="0x101" size="1" mask="0xFF"/>
                <register caption="PORT H Input Pins" name="PINH" offset="0x100" size="1" mask="0xFF"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTJ">
                <register caption="PORT J Data Register" name="PORTJ" offset="0x105" size="1" mask="0xFF"/>
                <register caption="PORT J Data Direction Register" name="DDRJ" offset="0x104" size="1" mask="0xFF"/>
                <register caption="PORT J Input Pins" name="PINJ" offset="0x103" size="1" mask="0xFF"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTK">
                <register caption="PORT K Data Register" name="PORTK" offset="0x108" size="1" mask="0xFF"/>
                <register caption="PORT K Data Direction Register" name="DDRK" offset="0x107" size="1" mask="0xFF"/>
                <register caption="PORT K Input Pins" name="PINK" offset="0x106" size="1" mask="0xFF"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTL">
                <register caption="PORT L Data Register" name="PORTL" offset="0x10B" size="1" mask="0xFF"/>
                <register caption="PORT L Data Direction Register" name="DDRL" offset="0x10A" size="1" mask="0xFF"/>
                <register caption="PORT L Input Pins" name="PINL" offset="0x109" size="1" mask="0xFF"/>
            </register-group>
        </module>
        <module caption="Timer/Counter, 8-bit" name="TC8">
            <register-group caption="Timer/Counter, 8-bit" name="TC0">
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0B" offset="0x48" size="1"
                          mask="0xFF"/>
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x47" size="1"
                          mask="0xFF"/>
                <register caption="Timer/Counter0" name="TCNT0" offset="0x46" size="1" mask="0xFF"/>
                <register caption="Timer/Counter Control Register B" name="TCCR0B" offset="0x45" size="1">
                    <bitfield caption="Force Output Compare A" mask="0x80" name="FOC0A"/>
                    <bitfield caption="Force Output Compare B" mask="0x40" name="FOC0B"/>
                    <bitfield caption="" mask="0x08" name="WGM02"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter Control Register A" name="TCCR0A" offset="0x44" size="1">
                    <bitfield caption="Compare Output Mode, Phase Correct PWM Mode" mask="0xC0" name="COM0A"/>
                    <bitfield caption="Compare Output Mode, Fast PWm" mask="0x30" name="COM0B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM0"/>
                </register>
                <register caption="Timer/Counter0 Interrupt Mask Register" name="TIMSK0" offset="0x6E" size="1">
                    <bitfield caption="Timer/Counter0 Output Compare Match B Interrupt Enable" mask="0x04"
                              name="OCIE0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x02"
                              name="OCIE0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
                </register>
                <register caption="Timer/Counter0 Interrupt Flag register" name="TIFR0" offset="0x35" size="1"
                          ocd-rw="R">
                    <bitfield caption="Timer/Counter0 Output Compare Flag 0B" mask="0x04" name="OCF0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare Flag 0A" mask="0x02" name="OCF0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x01" name="TOV0"/>
                </register>
