bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA640.xml
            <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS">
                <value caption="Oscillator Cycles 2K" name="VAL_0x00" value="0x00"/>
                <value caption="Oscillator Cycles 4K" name="VAL_0x01" value="0x01"/>
                <value caption="Oscillator Cycles 8K" name="VAL_0x02" value="0x02"/>
                <value caption="Oscillator Cycles 16K" name="VAL_0x03" value="0x03"/>
                <value caption="Oscillator Cycles 32K" name="VAL_0x04" value="0x04"/>
                <value caption="Oscillator Cycles 64K" name="VAL_0x05" value="0x05"/>
                <value caption="Oscillator Cycles 128K" name="VAL_0x06" value="0x06"/>
                <value caption="Oscillator Cycles 256K" name="VAL_0x07" value="0x07"/>
                <value caption="Oscillator Cycles 512K" name="VAL_0x08" value="0x08"/>
                <value caption="Oscillator Cycles 1024K" name="VAL_0x09" value="0x09"/>
            </value-group>
        </module>
        <module caption="EEPROM" name="EEPROM">
            <register-group caption="EEPROM" name="EEPROM">
                <register caption="EEPROM Address Register Low Bytes" name="EEAR" offset="0x41" size="2" mask="0x0FFF"/>
                <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1" mask="0xFF"/>
                <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
                    <bitfield caption="EEPROM Programming Mode Bits" mask="0x30" name="EEPM" values="EEP_MODE"/>
                    <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
                    <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
                    <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEPE"/>
                    <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
                </register>
            </register-group>
            <value-group caption="" name="EEP_MODE">
                <value caption="Erase and Write in one operation" name="VAL_0x00" value="0x00"/>
                <value caption="Erase Only" name="VAL_0x01" value="0x01"/>
                <value caption="Write Only" name="VAL_0x02" value="0x02"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 16-bit" name="TC16">
            <register-group caption="Timer/Counter, 16-bit" name="TC5">
                <register caption="Timer/Counter5 Control Register A" name="TCCR5A" offset="0x120" size="1">
                    <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM5A"/>
                    <bitfield caption="Compare Output Mode 5B, bits" mask="0x30" name="COM5B"/>
                    <bitfield caption="Compare Output Mode 5C, bits" mask="0x0C" name="COM5C"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM5"/>
                </register>
                <register caption="Timer/Counter5 Control Register B" name="TCCR5B" offset="0x121" size="1">
                    <bitfield caption="Input Capture 5 Noise Canceler" mask="0x80" name="ICNC5"/>
                    <bitfield caption="Input Capture 5 Edge Select" mask="0x40" name="ICES5"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM5" lsb="2"/>
                    <bitfield caption="Prescaler source of Timer/Counter 5" mask="0x07" name="CS5"
                              values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter 5 Control Register C" name="TCCR5C" offset="0x122" size="1">
                    <bitfield caption="Force Output Compare 5A" mask="0x80" name="FOC5A"/>
                    <bitfield caption="Force Output Compare 5B" mask="0x40" name="FOC5B"/>
                    <bitfield caption="Force Output Compare 5C" mask="0x20" name="FOC5C"/>
                </register>
                <register caption="Timer/Counter5 Bytes" name="TCNT5" offset="0x124" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter5 Output Compare Register A Bytes" name="OCR5A" offset="0x128" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter5 Output Compare Register B Bytes" name="OCR5B" offset="0x12A" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter5 Output Compare Register B Bytes" name="OCR5C" offset="0x12C" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter5 Input Capture Register Bytes" name="ICR5" offset="0x126" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter5 Interrupt Mask Register" name="TIMSK5" offset="0x73" size="1">
                    <bitfield caption="Timer/Counter5 Input Capture Interrupt Enable" mask="0x20" name="ICIE5"/>
                    <bitfield caption="Timer/Counter5 Output Compare C Match Interrupt Enable" mask="0x08"
                              name="OCIE5C"/>
                    <bitfield caption="Timer/Counter5 Output Compare B Match Interrupt Enable" mask="0x04"
                              name="OCIE5B"/>
                    <bitfield caption="Timer/Counter5 Output Compare A Match Interrupt Enable" mask="0x02"
                              name="OCIE5A"/>
                    <bitfield caption="Timer/Counter5 Overflow Interrupt Enable" mask="0x01" name="TOIE5"/>
                </register>
                <register caption="Timer/Counter5 Interrupt Flag register" name="TIFR5" offset="0x3A" size="1"
                          ocd-rw="">
                    <bitfield caption="Input Capture Flag 5" mask="0x20" name="ICF5"/>
                    <bitfield caption="Output Compare Flag 5C" mask="0x08" name="OCF5C"/>
                    <bitfield caption="Output Compare Flag 5B" mask="0x04" name="OCF5B"/>
                    <bitfield caption="Output Compare Flag 5A" mask="0x02" name="OCF5A"/>
                    <bitfield caption="Timer/Counter5 Overflow Flag" mask="0x01" name="TOV5"/>
                </register>
            </register-group>
            <register-group caption="Timer/Counter, 16-bit" name="TC4">
                <register caption="Timer/Counter4 Control Register A" name="TCCR4A" offset="0xA0" size="1">
                    <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM4A"/>
                    <bitfield caption="Compare Output Mode 4B, bits" mask="0x30" name="COM4B"/>
                    <bitfield caption="Compare Output Mode 4C, bits" mask="0x0C" name="COM4C"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM4"/>
                </register>
                <register caption="Timer/Counter4 Control Register B" name="TCCR4B" offset="0xA1" size="1">
                    <bitfield caption="Input Capture 4 Noise Canceler" mask="0x80" name="ICNC4"/>
                    <bitfield caption="Input Capture 4 Edge Select" mask="0x40" name="ICES4"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM4" lsb="2"/>
                    <bitfield caption="Prescaler source of Timer/Counter 4" mask="0x07" name="CS4"
                              values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter 4 Control Register C" name="TCCR4C" offset="0xA2" size="1">
                    <bitfield caption="Force Output Compare 4A" mask="0x80" name="FOC4A"/>
                    <bitfield caption="Force Output Compare 4B" mask="0x40" name="FOC4B"/>
                    <bitfield caption="Force Output Compare 4C" mask="0x20" name="FOC4C"/>
                </register>
                <register caption="Timer/Counter4 Bytes" name="TCNT4" offset="0xA4" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter4 Output Compare Register A Bytes" name="OCR4A" offset="0xA8" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter4 Output Compare Register B Bytes" name="OCR4B" offset="0xAA" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter4 Output Compare Register B Bytes" name="OCR4C" offset="0xAC" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter4 Input Capture Register Bytes" name="ICR4" offset="0xA6" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter4 Interrupt Mask Register" name="TIMSK4" offset="0x72" size="1">
                    <bitfield caption="Timer/Counter4 Input Capture Interrupt Enable" mask="0x20" name="ICIE4"/>
                    <bitfield caption="Timer/Counter4 Output Compare C Match Interrupt Enable" mask="0x08"
                              name="OCIE4C"/>
                    <bitfield caption="Timer/Counter4 Output Compare B Match Interrupt Enable" mask="0x04"
                              name="OCIE4B"/>
                    <bitfield caption="Timer/Counter4 Output Compare A Match Interrupt Enable" mask="0x02"
                              name="OCIE4A"/>
                    <bitfield caption="Timer/Counter4 Overflow Interrupt Enable" mask="0x01" name="TOIE4"/>
                </register>
