bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA640.xml
                <register caption="Timer/Counter1 Interrupt Flag register" name="TIFR1" offset="0x36" size="1"
                          ocd-rw="R">
                    <bitfield caption="Input Capture Flag 1" mask="0x20" name="ICF1"/>
                    <bitfield caption="Output Compare Flag 1C" mask="0x08" name="OCF1C"/>
                    <bitfield caption="Output Compare Flag 1B" mask="0x04" name="OCF1B"/>
                    <bitfield caption="Output Compare Flag 1A" mask="0x02" name="OCF1A"/>
                    <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="JTAG Interface" name="JTAG">
            <register-group caption="JTAG Interface" name="JTAG">
                <register caption="On-Chip Debug Related Register in I/O Memory" name="OCDR" offset="0x51" size="1"
                          mask="0xFF" ocd-rw=""/>
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
                </register>
                <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1" ocd-rw="R">
                    <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
                </register>
            </register-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="External Interrupt Control Register A" name="EICRA" offset="0x69" size="1">
                    <bitfield caption="External Interrupt Sense Control Bit" mask="0xC0" name="ISC3"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt Sense Control Bit" mask="0x30" name="ISC2"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt Sense Control Bit" mask="0x0C" name="ISC1"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt Sense Control Bit" mask="0x03" name="ISC0"
                              values="INTERRUPT_SENSE_CONTROL"/>
                </register>
                <register caption="External Interrupt Control Register B" name="EICRB" offset="0x6A" size="1">
                    <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0xC0" name="ISC7"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x30" name="ISC6"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x0C" name="ISC5"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x03" name="ISC4"
                              values="INTERRUPT_SENSE_CONTROL"/>
                </register>
                <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
                    <bitfield caption="External Interrupt Request 7 Enable" mask="0xFF" name="INT"/>
                </register>
                <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
                    <bitfield caption="External Interrupt Flags" mask="0xFF" name="INTF"/>
                </register>
                <register caption="Pin Change Mask Register 2" name="PCMSK2" offset="0x6D" size="1" mask="0xFF"/>
                <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x6C" size="1" mask="0xFF"/>
                <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x6B" size="1" mask="0xFF"/>
                <register caption="Pin Change Interrupt Flag Register" name="PCIFR" offset="0x3B" size="1" ocd-rw="R">
                    <bitfield caption="Pin Change Interrupt Flags" mask="0x07" name="PCIF"/>
                </register>
                <register caption="Pin Change Interrupt Control Register" name="PCICR" offset="0x68" size="1">
                    <bitfield caption="Pin Change Interrupt Enables" mask="0x07" name="PCIE"/>
                </register>
            </register-group>
            <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any Logical Change of INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="CPU Registers" name="CPU">
            <register-group caption="CPU Registers" name="CPU">
                <register caption="Status Register" name="SREG" offset="0x5F" size="1">
                    <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
                    <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="Sign Bit" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
